Tekla.Structures.ModelInternal.Operation.ExportModel(System.String,System.String,System.String,System.String,System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Exports TS model to file.
outPath: Output file name and path.
basePointGuid:
basePointExportType:
exportType:
propertiesPath:
selectedOnly:
assemblies:
allAssemblyParts:
parts:
rebars:
bolts:
welds:
surfaces:
surfaceTreatments:
grids:
spatialHierarchy:
pours:
Returns: True, if success.

Tekla.Structures.ModelInternal.Operation.ExportRevitFromAll(System.String,System.String,Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.Boolean,System.Int32@,System.Int32@,System.String@)
Revit export from all objects.
FileName:  The name of the rvt export file.
Folder:  The export folder.
BasePoint: Defines which base point is used in export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
UpdateSelected: Update the existing file
exportedObjects: Number of objects successfully exported.
exportFailedObjects: Number of objects that failed to export
userName: Current user user name
Returns: int, defines the final run state.

Tekla.Structures.ModelInternal.Operation.ExportRevitFromSelected(System.String,System.String,Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.Boolean,System.Int32@,System.Int32@,System.String@)
Revit export from selected objects.
FileName:  The name of the export rvt file.
Folder:  The export folder.
BasePoint: Defines which base point is used in export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
UpdateSelected: Update the existing file
exportedObjects: Number of objects successfully exported.
exportFailedObjects: Number of objects that failed to export
userName: Current user user name
Returns: int, defines the final run state

Tekla.Structures.ModelInternal.Operation.DoExportRevit(System.String,System.String,Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.Boolean,System.Boolean,System.Int32@,System.Int32@,System.String@)


Tekla.Structures.ModelInternal.Operation.ComponentGetAppliedAttributes(Tekla.Structures.Model.BaseComponent)
Gets the applied attributes of given component type.
baseComponent: The component type.
Returns: A dictionary of applied attribute names/values.

Tekla.Structures.ModelInternal.Operation.ComponentGetAppliedAttributes(Tekla.Structures.Model.BaseComponent,System.Boolean)
Gets the applied attributes of given component type.
baseComponent: The component type.
ignoreDefaultValues: Defines if attributes with default values are also fetched.
Returns: A dictionary of applied attribute names/values.